
&После("УстановкаПараметровСеанса")
Процедура РБ_УстановкаПараметровСеанса(ИменаПараметровСеанса)
	Если РольДоступна("РБ_ЧтениеРабочийСтол1С") Тогда
		НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
		СоставФорм = Новый СоставФормНачальнойСтраницы;
		СоставФорм.ЛеваяКолонка.Добавить("Обработка.РабочийСтол.Форма.ФормаРС");
		НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", , НастройкиНачальнойСтраницы);
	КонецЕсли;
КонецПроцедуры
