
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТаблицаОбъектов.Очистить();
	
	Таб = Параметры.ТаблицаОбъектов.Выгрузить();
	
	Для Каждого Стр Из Таб Цикл 
		СтрокаТаблицы = ТаблицаОбъектов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы,Стр);
		Если Стр.ВидОбъекта = "Справочник" Тогда 
			 СтрокаТаблицы.Картинка = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.Справочник);
		ИначеЕсли Стр.ВидОбъекта = "Документ" Тогда 
			 СтрокаТаблицы.Картинка = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.Документ);
		ИначеЕсли Стр.ВидОбъекта = "Обработка" Тогда
			 СтрокаТаблицы.Картинка = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.Обработка);
		ИначеЕсли Стр.ВидОбъекта = "Отчет" Тогда
			 СтрокаТаблицы.Картинка = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.Отчеты);
		КонецЕсли;	
	КонецЦикла;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Оповестить("ОбновитьИнтерфейс",ТаблицаОбъектов);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбъектовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры
