
// Записать настройки рабочего стола.
// 
// Параметры:
//  Пользователи - Массив Из СправочникСсылка.Пользователи,СправочникСсылка.Пользователи - Массив пользователей
//  Настройка - ХранилищеЗначения - Настройка
Процедура ЗаписатьНастройкиРабочегоСтола(Пользователи, Настройка) Экспорт
	
	Если ТипЗнч(Пользователи) <> Тип("Массив") Тогда
		СписокПользователей = Новый Массив();;
		СписокПользователей.Добавить(Пользователи);
	Иначе
		СписокПользователей = Пользователи;
	КонецЕсли;
	
	Для Каждого Пользователь Из СписокПользователей Цикл
		МенеджерЗаписи = РегистрыСведений.РБ_НастройкиРабочегоСтола.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Пользователь = Пользователь;
		МенеджерЗаписи.Настройка = Настройка;
		МенеджерЗаписи.Записать();
	КонецЦикла;
КонецПроцедуры

// Получить настройку рабочего стола.
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь
// 
// Возвращаемое значение:
//  ХранилищеЗначения - Получить настройку рабочего стола
Функция ПолучитьНастройкуРабочегоСтола(Пользователь) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	РБ_НастройкиРабочегоСтола.Настройка
						  |ИЗ
						  |	РегистрСведений.РБ_НастройкиРабочегоСтола КАК РБ_НастройкиРабочегоСтола
						  |ГДЕ
						  |	РБ_НастройкиРабочегоСтола.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Настройка;
	КонецЕсли;
	Возврат Новый ХранилищеЗначения(Неопределено);
КонецФункции