Процедура ВыполнитьОтчетДиаграмму(ОтчетОбъект,ОтборНаФорме,Диаграмма) Экспорт 
		
	
	СхемаКомпоновкиДанных = ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");

		
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ОтборНаФорме.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	
	 ТЗ = ВыгрузитьРезультатСКДПоМакету(МакетКомпоновки);
	
	 
	 	
	
	Диаграмма.Очистить();	
	
	
	
	
	Для Каждого Стр Из ТЗ Цикл 
		Если Не ЗначениеЗаполнено(Стр.Склад) Тогда 
			 Продолжить;
		КонецЕсли;	
		Серия = Диаграмма.УстановитьСерию("");//Стр.Номенклатура);
		ТочкаДиаграммы = Диаграмма.УстановитьТочку(Стр.Склад);
		
		
		//Попытка
		//	Диаграмма.Точки[ТаблицаСумм.Индекс(Стр)].Текст = Формат(Стр.Период,"ДФ=dd.MM.yyyy");
		//Исключение
		//	Попытка	
		//		Диаграмма.Точки[ТаблицаСумм.Индекс(Стр)-1].Текст = Формат(Стр.Период,"ДФ=dd.MM.yyyy");
		//	Исключение	
		//		Диаграмма.Точки[0].Текст = Формат(Стр.Период,"ДФ=dd.MM.yyyy");
		//	КонецПопытки;	
		//КонецПопытки;  
		
		
		Диаграмма.УстановитьЗначение(ТочкаДиаграммы,Серия,Стр.КоличествоКонечныйОстаток);
		
	КонецЦикла;	
	
	Диаграмма.ОтображатьЗаголовок  		= Ложь;
	Диаграмма.ОтображатьЛегенду    		= Ложь;
	
	Диаграмма.ВидПодписей				= ВидПодписейКДиаграмме.СерияЗначение;	
	 
	 
	 
	 
	 
КонецПроцедуры	


//Функция выгружает результат СКД 
//по макету в таблицу значений
Функция ВыгрузитьРезультатСКДПоМакету(МакетКомпоновки, ВнешниеНаборыДанных = Неопределено, ВыводВДерево = Ложь) Экспорт
    
    Результат = Новый ТаблицаЗначений;
    Если ВыводВДерево Тогда
        Результат = Новый ДеревоЗначений;
    КонецЕсли;
    
    //Создаем процессор компоновки
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    Если ВнешниеНаборыДанных = Неопределено Тогда
        ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,,Истина);
    Иначе
        ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных,,Истина);
    КонецЕсли;
    
    //Выводим в таблицу значений
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ПроцессорВывода.УстановитьОбъект(Результат);
    Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
    Возврат Результат;
    
КонецФункции